ka2_2024/src/InformationRegisters/НастройкиИнтеграцииКабинетСотрудника/НастройкиИнтеграцииКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИнтеграцииКабинетСотрудника</name>
  <resources>
    <name>УдалитьВидКонтактнойИнформацииМобильныйТелефон</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВидКонтактнойИнформацииАдресЭлектроннойПочты</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяКадровыйЭДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДнейСохраненияПубликации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПубликоватьСтруктуруЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьОбсуждения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЧатБот</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>КоординаторОбсуждений</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПриложенияСовместногоИспользования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособПолученияСогласияНаПрисоединениеККЭДО</name>
    <type>
      <types>EnumRef.СпособыПолученияСогласияНаПрисоединениеККЭДО</types>
    </type>
  </resources>
  <resources>
    <name>ВариантОтчетаРасчетныйЛисток</name>
    <type>
      <types>CatalogRef.ВариантыОтчетов</types>
    </type>
  </resources>
  <resources>
    <name>ВариантОтчетаРасчетныйЛистокЗаПервуюПоловину</name>
    <type>
      <types>CatalogRef.ВариантыОтчетов</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьРасчетныеЛистыОтдельнымЗапросом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

ka2_2024/src/Enums/СпособыПолученияСогласияНаПрисоединениеККЭДО/СпособыПолученияСогласияНаПрисоединениеККЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПолученияСогласияНаПрисоединениеККЭДО</name>
  <enumValues>
    <name>БумажныйДокумент</name>
  </enumValues>
  <enumValues>
    <name>УНЭП</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/InformationRegisters/НастройкиИнтеграцииКабинетСотрудника/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция НастройкиИнтеграции() Экспорт
	
	Настройки = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	
	СтруктураНастроек = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
							Настройки, Метаданные.РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника);
	
	Если Не ЗначениеЗаполнено(СтруктураНастроек.ДнейСохраненияПубликации) Тогда
		СтруктураНастроек.ДнейСохраненияПубликации = 5;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураНастроек.СпособПолученияСогласияНаПрисоединениеККЭДО) Тогда
		СтруктураНастроек.СпособПолученияСогласияНаПрисоединениеККЭДО = Перечисления.СпособыПолученияСогласияНаПрисоединениеККЭДО.БумажныйДокумент;	
	КонецЕсли;
	
	Возврат СтруктураНастроек;

КонецФункции

Процедура СохранитьНовыеВидыКонтактнойИнформации(ВидКИМобильныйТелефон, ВидКИАдресЭлектроннойПочты) Экспорт

	Настройки = НастройкиИнтеграции();
	Настройки.ВидКонтактнойИнформацииМобильныйТелефон = ВидКИМобильныйТелефон;
	Настройки.ВидКонтактнойИнформацииАдресЭлектроннойПочты = ВидКИАдресЭлектроннойПочты;
	
	НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура СохранитьЗначениеИспользуетсяКадровыйЭДО(ИспользуетсяКадровыйЭДО) Экспорт

	Настройки = НастройкиИнтеграции();
	Настройки.ИспользуетсяКадровыйЭДО = ИспользуетсяКадровыйЭДО;
	
	НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ОбновитьНастройкиФункциональностьСервиса");
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура СохранитьЗначениеДнейСохраненияПубликации(ДнейСохраненияПубликации) Экспорт

	Настройки = НастройкиИнтеграции();
	Настройки.ДнейСохраненияПубликации = ДнейСохраненияПубликации;
	
	НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура СохранитьЗначениеКоординаторОбсуждений(НовоеЗначение) Экспорт

	Настройки = НастройкиИнтеграции();
	Настройки.КоординаторОбсуждений = НовоеЗначение;
	
	НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура СохранитьЗначениеИдентификаторПриложенияСовместногоИспользования(НовоеЗначение) Экспорт

	Настройки = НастройкиИнтеграции();
	Настройки.ИдентификаторПриложенияСовместногоИспользования = НовоеЗначение;
	
	НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура СохранитьЗначениеСпособПолученияСогласияНаПрисоединениеККЭДО(СпособПолучения) Экспорт
	
	Настройки = НастройкиИнтеграции();
	Настройки.СпособПолученияСогласияНаПрисоединениеККЭДО = СпособПолучения;
	
	НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ОбновитьНастройкиФункциональностьСервиса");
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура СохранитьЗначениеВариантОтчетаРасчетныйЛисток(ВариантОтчетаРасчетныйЛисток) Экспорт
	Настройки = НастройкиИнтеграции();
	Настройки.ВариантОтчетаРасчетныйЛисток = ВариантОтчетаРасчетныйЛисток;
	СохранитьНастройки(Настройки);
КонецПроцедуры

Процедура СохранитьЗначениеВариантОтчетаРасчетныйЛистокЗаПервуюПоловину(ВариантОтчетаРасчетныйЛистокЗаПервуюПоловину) Экспорт
	Настройки = НастройкиИнтеграции();
	Настройки.ВариантОтчетаРасчетныйЛистокЗаПервуюПоловину = ВариантОтчетаРасчетныйЛистокЗаПервуюПоловину;
	СохранитьНастройки(Настройки);
КонецПроцедуры

Процедура СохранитьЗначениеФормироватьРасчетныеЛистыОтдельнымЗапросом(ФормироватьРасчетныеЛистыОтдельнымЗапросом) Экспорт
	Настройки = НастройкиИнтеграции();
	Настройки.ФормироватьРасчетныеЛистыОтдельнымЗапросом = ФормироватьРасчетныеЛистыОтдельнымЗапросом;
	СохранитьНастройки(Настройки);
КонецПроцедуры

Процедура СохранитьНастройки(Настройки)
	НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.Записать();
КонецПроцедуры

#КонецОбласти

#КонецЕсли
